DEFINE DATA
LOCAL
01 #X       (N03)
01 REDEFINE #X
  02 #X-A   (A03)
01 #Y       (A20)
END-DEFINE
*
#X = 10
#X = #X * 2
*
#Y = 'HELLO WORLD'
FOR #1 1 #X
  WRITE '=' #Y
END-FOR
WRITE 'WROTE ' #Y #X-A ' TIMES'
*
END
